export const CUTE_NAMES: string[] = [
    "Кошечка", "Собачка", "Осьминожка", "Пандочка", "Лисичка", "Зайка", "Белочка", "Енотик",
    "Пингвинёнок", "Тигрёнок", "Львёнок", "Хомячок", "Слоник", "Жирафик", "Лягушонок", "Совёнок",
    "Оленёнок", "Медвежонок", "Ёжик", "Дельфинчик", "Коала", "Уточка", "Цыплёнок", "Котёнок",
    "Щеночек", "Попугайчик", "Кенгуру", "Хамелеончик", "Выдра", "Улиточка", "Черепашка", "Сурикат",
    "Лемурчик", "Пчелка", "Хорек", "Шиншилла", "Капибара", "Тюленёнок", "Альпака",
    "Единорожка", "Дракончик", "Крольчонок", "Лисёнок", "Волчонок", "Барсучонок", "Сурок", "Обезьянка",
    "Панда", "Утконос", "Квокка", "Ленивец", "Крот", "Бобрёнок", "Барсик", "Мурзик", "Шарик", "Дружок",
    "Умка", "Бэмби", "Чебурашка", "Пушистик", "Зубастик", "Кнопка", "Малыш", "Рыжик", "Снежок", "Черныш",
    "Солнышко", "Звёздочка", "Облачко", "Цветочек", "Ягодка", "Конфетка", "Пончик", "Кекс", "Пряник",
    "Зефирка", "Карамелька", "Печенька", "Булочка", "Ватрушка", "Пышка", "Ириска", "Мармеладка",
    "Шоколадка", "Бусинка", "Снежинка", "Капелька", "Лучик", "Огонёк", "Ручеёк", "Листочек", "Грибочек",
    "Орешек", "Жёлудь", "Ветерок", "Тучка", "Игрушка"
];

export const getRandomCuteName = (): string => {
    return CUTE_NAMES[Math.floor(Math.random() * CUTE_NAMES.length)];
};
